Repository: schlom/Praktomat-1
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: The name of the interface that must be implemented.
de: Der Name des Interfaces, das implementiert werden muss.

source: Default heap to use
de: Standardmäßig zu verwendender Heap

source: Logic
de: Logik

source: Isabelle theories to be run in addition to those provided by the user (Library theories or theories uploaded using the Create File Checker). Do not include the file extensions. Separate multiple theories by space
de: Isabelle-Theorien, die zusätzlich zu den vom Benutzer bereitgestellten Theorien ausgeführt werden sollen (Bibliothekstheorien oder Theorien, die mit dem Create File Checker hochgeladen wurden). Schließen Sie die Dateierweiterungen nicht ein. Trennen Sie mehrere Theorien durch Leerzeichen

source: Additional Theories
de: Zusätzliche Theorien

source: Verifies that every submitted Isabelle theory can be processed without error
de: Verifiziert, dass jede eingereichte Isabelle-Theorie fehlerfrei verarbeitet werden kann

source: The fully qualified name of the test case class (without .class)
de: Der vollqualifizierte Name der Testfallklasse (ohne .class)

source: Class name
de: Klassenname

source: space-separated list of files to be ignored during compilation, i.e.: these files will not be compiled.
de: eine durch Leerzeichen getrennte Liste von Dateien, die beim Kompilieren ignoriert werden sollen, d.h.: diese Dateien werden nicht kompiliert.

source: ignore
de: Ignorieren

source: This Checker runs a JUnit Testcases existing in the sandbox. You may want to use CreateFile Checker to create JUnit .java and possibly input data files in the sandbox before running the JavaBuilder. JUnit tests will only be able to read input data files if they are placed in the data/ subdirectory.
de: Dieser Checker führt einen JUnit-Testfall aus, der in der Sandbox vorhanden ist. Sie können CreateFile Checker verwenden, um JUnit .java zu erstellen und möglicherweise Datendateien in die Sandbox einzugeben, bevor Sie JavaBuilder ausführen. JUnit-Tests können Eingabedatendateien nur lesen, wenn sie im Daten-/Unterverzeichnis abgelegt werden.

source: Java based test:
de: Java-basierter Test:

source: This Checker runs a java class. The java class must be existing in the sandbox, or in the folder '%s'. You may want to use CreateFile Checker to upload the .jar or java file and possibly input data files in the sandbox before running this check. JUnit tests will only be able to read input data files if they are placed in the data/ subdirectory. The following arguments will be passed to the main routine in the specified class: sandbox directory, user id, mat_number, solution id
de: Dieser Checker führt eine Java-Klasse aus. Die java-Klasse muss in der Sandbox oder im Ordner '%s' vorhanden sein. Sie können CreateFile Checker verwenden, um die .jar- oder java-Datei hochzuladen und möglicherweise Datendateien in die Sandbox einzugeben, bevor Sie diese Prüfung ausführen. JUnit-Tests können Eingabedatendateien nur lesen, wenn sie im Daten-/Unterverzeichnis abgelegt werden. Die folgenden Argumente werden an die Hauptroutine in der angegebenen Klasse übergeben: Sandbox-Verzeichnis, Benutzer-ID, mat_number, Lösungs-ID

source: ======== Test Results ====== </pre><br/><pre>
de: ======== Testergebnisse ====== <pre><br></pre>

source: The name of the file to preserve (e.g. out.txt)
de: Der Name der zu erhaltenden Datei (z.B. out.txt)

source: Keep file %s
de: Datei %s aufbewahren

source: <p>Could not find file <tt>%s</tt>.</p>
de: <p>Konnte Datei nicht finden <samp>%s</samp>.</p>

source: Lexical statistics
de: Lexikalische Statistik

source: This check is always passed.
de: Diese Prüfung wird immer bestanden.

source: {0} lines, including {1} code lines ({2}%), {3} comment lines ({4}%), {5} both ({6}%).
de: {0} Zeilen, einschließlich {1} Codezeilen ({2}%), {3} Kommentarzeilen ({4}%), {5} beide ({6}%).

source: {0} files, {1} lines, including {2} code lines ({3}%), {4} comment lines ({5}%), {6} both ({7}%).
de: {0} Dateien, {1} Zeilen, einschließlich {2} Codezeilen ({3}%), {4} Kommentarzeilen ({5}%), {6} beide ({7}%).

source: Line Width Checker (l 197): ZeroDivisionError
de: Zeilenbreiten-Prüfer (l 197): ZeroDivisionError

source: (no comment / code / coco lines in file!)
de: (kein Kommentar / Code / Coco Zeilen in der Datei!

source: The maximum length of a line of code.
de: Die maximale Länge einer Codezeile.

source: Max line length
de: Maximale Zeilenbreite

source: The amount of characters a tab represents.
de: Die Anzahl der Zeichen, die ein Tabulator repräsentiert.

source: tab width
de: Tabulatorbreite

source: Regular expression describing the filenames to be checked. Case insensitive. Blank: use all files.
de: Regulärer Ausdruck, der die zu überprüfenden Dateinamen beschreibt. Groß- und Kleinschreibung wird nicht berücksichtigt. Leer: alle Dateien verwenden.

source: include
de: Einschließen

source: Regular expression describing included filenames, which shall be excluded. Case insensitive. Blank: use all files.
de: Regulärer Ausdruck, der eingeschlossene Dateinamen beschreibt, die ausgeschlossen werden sollen. Groß- und Kleinschreibung wird nicht beachtet. Leer: alle Dateien verwenden.

source: exclude
de: Ausschließen

source: R script to execute. If left blank, it will run any *.R file, as long as there is only one.
de: R-Skript zum ausführen. Wenn es leer gelassen wird, führt es jede *.R-Datei aus, solange es eine gibt.

source: Require the script to create an Rplots.pdf file.
de: Zum Erstellen einer Rplots.pdf-Datei ist das Skript erforderlich.

source: Require Plots
de: Benötigt Diagramme

source: If the R script creates a Rplots.pdf file, keep it.
de: Wenn das R-Skript eine Rplots.pdf-Datei erstellt, behalten Sie diese.

source: Keep Plots
de: Diagramme behalten

source: Runs a submitted R script using the Rscript tool
de: Führt ein eingereichtes R-Skript mit dem Rscript-Tool aus

source: filename
de: Dateiname

source: A script (e.g. a shell script) to run. Its output will be displayed to the user (if public), the checker will succeed if it returns an exit code of 0. The environment will contain the variables JAVA and PROGRAM.
de: Ein Skript (z.B. ein Shell-Skript) zum Ausführen. Seine Ausgabe wird dem Benutzer angezeigt (falls öffentlich), der Checker hat Erfolg, wenn er einen Exit-Code von 0 zurückgibt.Die Umgebung enthält die Variablen JAVA und PROGRAM.

source: Regular expression describing passages to be removed from the output.
de: Zum Erstellen einer Rplots.pdf-Datei ist das Skript erforderlich.

source: Remove
de: Entfernen

source: If the script doesn't return HTML it will be enclosed in &lt; pre &gt; tags.
de: Wenn das Skript kein HTML zurückgibt, wird es in &lt; pre &gt; Tags eingeschlossen.

source: Returns HTML
de: Gibt HTML zurück

source: The text must not be in the solution
de: Der Text darf nicht in der Lösung enthalten sein

source: The text has to be in the solution
de: Der Text muss in der Lösung enthalten sein

source: Select:
de: Auswahl:

source: Is a submission required to provide a main method or function?
de: Ist eine Einreichung notwendig die eine main-Methode besitzt?

source: flags for libraries like '-lm ' as math library for C
de: Flags für Libraries wie z.B. '-lm ' als Mathe Library für C

source: flags for additional search path for compiler or linker
de: Flags für zusätzliche Suchpfade für den Compiler oder Linker

source: Compiler or Linker flags
de: Compiler oder Linker-Flags

source: Regular expression describing all source files to be passed to the compiler or linker. (Play with RegEx at <a href="http://pythex.org/" target="_blank">http://pythex.org/ </a>
de: Regulärer Ausdruck, der alle an den Compiler oder Linker zu übergebenden Quelldateien beschreibt. (Play with RegEx at <a href="http://pythex.org/" target="_blank">http://pythex.org/ </a>

source: Output flags. '%s' will be replaced by the program name.
de: Ausgabe-Flags. '%s' wird durch den Programmnamen ersetzt.

source: choose link output type. '%s' will replaced by output_name.
de: Link-Ausgabeart wählen. '%s' wird durch output_name ersetzt.

source: choose a outputname. '%s' will be replaced by an internal default name.
de: wählen Sie einen Ausgabenamen. '%s' wird durch einen internen Standardnamen ersetzt.

source: Output Flags
de: Ausgabe Flags

source: Compiler libraries
de: Compiler-Bibliotheken

source: Libs
de: Bibliotheken

source: Regular expression describing all source files to be passed to the compiler.
de: Regulärer Ausdruck, der alle an den Compiler zu übergebenden Quelldateien beschreibt.

source: File Pattern
de: Dateimuster

source: Is a submission required to provide a main method?
de: Ist eine Einreichung notwendig die eine main-Methode besitzt?

source: Main required
de: Main notwendig

source: The main module could not be found.
de: Main konnte nicht gefunden werden.

source: A class containing the main method ('public static void main(String[] args)') could not be found in the files %s
de: Eine Klasse, die die Hauptmethode ('public static void main(String[] args)') enthält, konnte in den Dateien %s nicht gefunden werden

source: Setting
de: Einstellung

source: Settings
de: Einstellungen

source: Email validation regex
de: E-Mail-Validierung

source: Mat number validation regex
de: Matrikelnummervalidierung

source: Regular expression used to check the student number.
de: Regulärer Ausdruck, der zur Überprüfung der Studentennummer verwendet wird.

source: New user via sso
de: Neuer Benutzer über sso

source: If enabled, users previously unknown to the Praktomat can register via single sign on (eg. Shibboleth).
de: Falls aktiviert, können sich Benutzer, die dem Praktomat bisher nicht bekannt sind, per Einzelanmeldung registrieren (z.B. Shibboleth).

source: Deny registration from
de: Anmeldung verweigern von

source: After this date, registration won't be possible.
de: Nach diesem Datum ist eine Registrierung nicht mehr möglich.

source: Account activation days
de: Kontoaktivierungstage

source: Days until the user has time to activate his account with the link sent in the registration email.
de: Tage, bis der Benutzer Zeit hat, sein Konto mit dem in der Registrierungs-E-Mail versandten Link zu aktivieren.

source: Account manual validation
de: Konto manuelle Validierung

source: If enabled, registrations via the website must be manually validated by a trainer.
de: Falls aktiviert, müssen Anmeldungen über die Website manuell von einem Trainer validiert werden.

source: If enabled, users have to accept the disclaimer before using the site.
de: Falls aktiviert, müssen Benutzer die Erklärung akzeptieren, bevor sie die Website nutzen können.

source: Accept all solutions
de: Akzeptieren Sie alle Lösungen

source: If enabled, solutions can become the final soution even if not all required checkers are passed.
de: Wenn aktiviert, können Lösungen zur Endlösung werden, auch wenn nicht alle erforderlichen Prüfungen bestanden werden.

source: Anonymous attestation
de: Anonyme Bescheinigung

source: If enabled, the tutor can't see the name of the user who submitted the solution.
de: Wenn aktiviert, kann der Tutor den Namen des Benutzers, der die Lösung eingereicht hat, nicht sehen.

source: Finale grades published
de: Endgültige Bewertungen veröffentlicht

source: If enabled, all users can see their final grades.
de: Wenn aktiviert, können alle Benutzer ihre Abschlussbewertungen sehen.

source: Sum
de: Summe

source: Average
de: Durchschnitt

source: Final grades arithmetic option
de: Endbewertung arithmetische Option

source: Without
de: Ohne

source: Including
de: mit

source: Final grades plagiarism option
de: Endgültige Bewertungen Plagiatsoption

source: Invisible attestor
de: Geheimer Gutachter

source: If enabled, a user will not learn which tutor wrote attestations to his solutions. In particular, tutors will not be named in attestation emails.
de: Wenn diese Option aktiviert ist, erfährt ein Benutzer nicht, welcher Tutor Bescheinigungen für seine Lösungen geschrieben hat. Insbesondere werden die Tutoren in den Bescheinigungs-E-Mails nicht namentlich genannt.

source: Attestation Reply-To
de: Bescheinigung Reply-To

source: Additional Reply-To: address to be set for attestation emails.
de: Zusätzliche Reply-To: Adresse, die für Bescheinigungs-E-Mails festgelegt wird.

source: Attestation allow run checkers
de: Bescheinigung erlaubt Ausführung der Checker

source: If enabled, tutors can re-run all checkers for solutions they attest. Can be used to re-run checks that failed due to problems unrelated to the solution (e.g.: time-outs because of high server load), but needs to be used with care, since it may change the results from what the student saw when he submitted his solution.
de: Wenn diese Option aktiviert ist, können die Dozenten alle Prüfer für die von ihnen bescheinigten Lösungen erneut ausführen. Kann verwendet werden, um Prüfungen erneut durchzuführen, die aufgrund von Problemen fehlgeschlagen sind, die nichts mit der Lösung zu tun haben (z.B.: Auszeiten wegen hoher Serverlast), muss aber mit Vorsicht verwendet werden, da es die Ergebnisse gegenüber dem, was der Student bei der Einreichung seiner Lösung gesehen hat, verändern kann.

source: Default settings for jPlag
de: Standardeinstellungen für jPlag

source: Chunk
de: Stück

source: Chunks
de: Stücke

source: Makes it easy to display chunks as inlines in Settings.
de: Macht es einfach, Teile als Inlines in den Einstellungen anzuzeigen.

source: A unique name for this chunk of content
de: Ein eindeutiger Name für diesen Teil des Inhalts

source: Content
de: Inhalt

source: Checkers (including those not run at submission) for selected solutions were successfully run.
de: Die Checker (einschließlich derjenigen, die bei der Einreichung nicht ausgeführt wurden) für ausgewählte Lösungen wurden erfolgreich ausgeführt.

source: Run Checkers (including those not run at submission) for selected solution
de: Checkers (einschließlich derjenigen, die bei der Einreichung nicht laufen) für die ausgewählte Lösung ausführen

source: Checkers (only those also run at submission) for selected solutions were successfully run.
de: Checker (nur diejenigen, die auch bei der Einreichung laufen) für ausgewählte Lösungen wurden erfolgreich ausgeführt.

source: Run Checkers (only those also run at submission) for selected solutions
de: Starte Checker (nur diejenigen, die auch bei der Einreichung laufen) für ausgewählte Lösungen

source: %d solutions marked as plagiated
de: %d als plagiiert markierte Lösungen

source: Mark as plagiated
de: Als Plagiat markieren

source: %d solutions marked as not plagiated
de: %d als nicht plagiiert markierte Lösungen

source: Mark as not plagiated
de: Nicht als Plagiat markieren

source: View (User Site)
de: Ansicht (Benutzerseite)

source: <a href="%s">Run Checkers</a>
de: <a href="%s">Führe Checker aus</a>

source: Run Checker (incl. those run at submission)
de: Starte Checker (inkl. derjenigen, die bei der Einreichung laufen)

source: Solution author
de: Author der Lösungen

source: <a href="{0}">Attestations of this solution</a> • <a href="{1}">User Site view of this solution</a>
de: <a href="{0}">Bewertungen dieser Lösung</a> - <a href="{1}">Benutzerseitenansicht dieser Lösung</a>

source: Tests failed
de: Tests fehlgeschlagen

source: Latest of only failed
de: Die Letzten der nur fehlgeschlagenen

source: The file of type %s is not supported.
de: Die Datei vom Typ %s wird nicht unterstützt.

source: The plain text file '%(file)s' contains a NUL character, which is not supported.
de: Die Klartextdatei '%(file)s' enthält ein NUL-Zeichen, das nicht unterstützt wird.

source: The zip file seems to be corrupt.
de: Die Zip-Datei scheint korrupt zu sein.

source: The zip file is too big.
de: Die Zip-Datei ist zu groß.

source: The file '%(file)s' of guessed mime type '%(type)s' in this zip file is not supported.
de: Die Datei '%(file)s' des erratenen mime-Typs '%(type)s' in dieser Zip-Datei wird nicht unterstützt.

source: The plain text file '%(file)s' in this zip file contains a NUL character, which is not supported.
de: Die Klartextdatei '%(file)s' in dieser Zip-Datei enthält ein NUL-Zeichen, das nicht unterstützt wird.

source: Uhoh - something unexpected happened.
de: Oooh - etwas Unerwartetes ist passiert.

source: Tar files are not supported, please upload the files individually or use a zip file.
de: Die Klartextdatei '%(file)s' in dieser Zip-Datei enthält ein NUL-Zeichen, das nicht unterstützt wird.

source: The file '%(file)s' is bigger than %(size)KiB which is not supported.
de: Die Datei '%(file)s' ist größer als %(size)KiB, die nicht unterstützt wird.

source: You must choose at least one file.
de: Sie müssen mindestens eine Datei auswählen.

source: Solutions
de: Lösungen

source: Id unique in task and user. E.g. Solution 1 of user X in task Y in contrast to global solution Z
de: Id ist einzigartig pro Aufgabe und Benutzer. Z.B. Lösung 1 von Benutzer X in Aufgabe Y im Gegensatz zur globalen Lösung Z

source: solution author
de: Autor der Lösungen

source: Indicates whether this solution is a test upload.
de: Gibt an, ob es sich bei dieser Lösung um einen Test-Upload handelt.

source: Testupload
de: Testlösung hochladen

source: Indicates whether the solution has passed all public and required tests.
de: Zeigt an, ob die Lösung alle öffentlichen und erforderlichen Tests bestanden hat.

source: Accepted
de: Akzeptiert

source: Indicates whether the solution has at least failed one public and not required test.
de: Gibt an, ob die Lösung mindestens einen öffentlichen und nicht erforderlichen Test nicht bestanden hat.

source: Warnings
de: Warnungen

source: Indicates whether the solution is a rip-off of another one.
de: Zeigt an, ob die Lösung ein Plagiat von einer anderen ist.

source: Plagiarism
de: Plagiat

source: Indicates whether this solution is the last (accepted) of the author.
de: Zeigt an, ob diese Lösung die letzte (akzeptierte) des Autors ist.

source: Source code file as part of a solution an archive file (.zip) containing multiple solution files.
de: Quellcodedatei als Teil einer Lösung eine Archivdatei (.zip), die mehrere Lösungsdateien enthält.

source: Guessed file type. Automatically set on save().
de: Geschätzter Dateityp. Wird automatisch bei save() gesetzt.

source: %s submission confirmation
de: %s Einreichungsbestätigung

source: Export Tasks
de: Aufgaben exportieren

source: final solutions were successfully checked (%d seconds elapsed).
de: wurden erfolgreich überprüft (%d Sekunden verstrichen).

source: Run all checkers
de: Alle Checker starten

source: <a href="{0}">Attestations (User site)</a>
de: <a href="{0}">Bescheinigungen (Benutzerseite)</a>

source: <a href="{0}">Test Submission</a>
de: <a href="{0}">Testeinreichung</a>

source: Test Submission
de: Testeinreichung

source: <a href="{0}">Attestations (including for-user-submission)</a> • <a href="{1}">Test upload</a>
de: <a href="{0}">Bewertungen (einschließlich Benutzer-Einreichung)</a> • <a href="{1}">Test upload</a>

source: The name of the task
de: Der Name der Aufgabe

source: Title
de: Titel

source: Description of the assignment.
de: Beschreibung der Aufgabe.

source: The time on which the user will see the task.
de: Die Zeit, zu der der Benutzer die Aufgabe sehen wird.

source: Publication Date
de: Veröffentlichungsdatum

source: The time up until the user has time to complete the task. This time will be extended by one hour for those who just missed the deadline.
de: Die Zeit, bis der Benutzer Zeit hat, die Aufgabe zu erledigen. Diese Zeit wird für diejenigen, die die Frist gerade verpasst haben, um eine Stunde verlängert.

source: Submission date
de: Einreichungsdatum

source: Regular Expression describing the mime types of solution files that the user is allowed to upload.
de: Regulärer Ausdruck, der die Mime-Typen von Lösungsdateien beschreibt, die der Benutzer hochladen darf.

source: Supported file types
de: Unterstützte Dateitypen

source: The maximum size of an uploaded solution file in kilobyte.
de: Die maximale Größe einer hochgeladenen Lösungsdatei in Kilobyte.

source: Max file size
de: Max. Dateigröße

source: Model Solution
de: Musterlösung

source: Indicates whether the checker which don't run immediately on submission have been executed.
de: Zeigt an, ob die Checker, die nicht sofort bei der Einreichung laufen, ausgeführt wurden.

source: All checker finished
de: Alle Checker beendet

source: The scale used to mark the whole solution.
de: Die Skala, die zur Kennzeichnung der gesamten Lösung verwendet wurde.

source: Final grade rating scale
de: Endbewertungsskala

source: If the student has less points in his tasks than the sum of their warning thresholds, display a warning.
de: Wenn der Schüler weniger Punkte in seinen Aufgaben hat als die Summe der Warnschwellen, zeige eine Warnung an.

source: Warning threshold
de: Warnschwelle

source: Indicates that only trainers may publish attestations. Otherwise, tutors may publish final attestations within their tutorials.
de: Zeigt an, dass nur Trainer Bescheinigungen veröffentlichen dürfen. Ansonsten können die Tutoren Abschlussbestätigungen in ihren Lehrgängen veröffentlichen.

source: only trainers publish
de: Nur Trainer dürfen veröffentlicht

source: No new solution uploads since the last jPlag run
de: Keine neuen Lösungs-Uploads seit dem letzten jPlag-Test

source: JPlag up to date
de: JPlag ist aktuell

source: Tasks
de: Aufgaben

source: Import Task
de: Aufgabe importieren

source: Media File
de: Datei

source: Media Files
de: Dateien

source: HTML Injector
de: HTML-Injektor

source: HTML Injectors
de: HTML-Injektoren

source: Indicates whether HTML code shall be injected in public solution views, e.g.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/solutions/5710/
de: Zeigt an, ob HTML-Code in öffentliche Lösungsansichten eingespeist werden soll, z.B.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/solutions/5710/

source: inject in solution view
de: Einfügen in Lösungsansicht

source: Indicates whether HTML code shall be injected in private solution views, e.g.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/solutions/5710/full
de: Zeigt an, ob HTML-Code in private Lösungsansichten eingespeist werden soll, z.B.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/solutions/5710/

source: inject in solution full view
de: Einfügen in Lösungsvollansicht

source: Indicates whether HTML code shall be injected in attestation edits, e.g.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/attestation/134/edit
de: Gibt an, ob bei der Bearbeitung von Beglaubigungen HTML-Code eingefügt werden soll, z.B.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/attestation/134/edit

source: inject in attestation edit
de: Einfügen in Bescheinigungsbearbeitung

source: Indicates whether HTML code shall be injected in attestation views, e.g.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/attestation/134
de: Gibt an, ob HTML-Code in Beglaubigungsansichten eingefügt werden soll, z.B.: in https://praktomat.cs.kit.edu/2016_WS_Abschluss/attestation/134

source: inject in attestation view
de: Einfügen in Bescheinigungsansicht

source: HTML File
de: HTML-Datei

source: Enabled if the imported task is just used as template to create another task. If disabled, the publication date and the rating scale are also imported. This means that students might see the task immediately, and rating scales might be duplicated.
de: Aktiviert, wenn die importierte Aufgabe nur als Vorlage zum Erstellen einer weiteren Aufgabe verwendet wird. Wenn deaktiviert, werden auch das Veröffentlichungsdatum und die Bewertungsskala importiert. Dies bedeutet, dass die Studierenden die Aufgabe sofort sehen können und die Bewertungsskala möglicherweise doppelt vorhanden ist.

source: Is template
de: Vorlage
