Repository: schlom/Praktomat-1
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: Personal info
de: Persönliche Informationen

source: Permissions
de: Berechtigungen

source: Groups
de: Gruppen

source: Important dates
de: Wichtige Daten

source: Custom text
de: Benutzerdefinierter Text

source: is trainer
de: Trainer

source: is tutor
de: Tutor

source: is coordinator
de: Koordinator

source: is failed attempt
de: gescheiterter Versuch

source: Users were successfully activated.
de: Die Benutzer wurden erfolgreich aktiviert.

source: set active
de: aktiv setzen

source: Users were successfully inactivated.
de: Die Benutzer wurden erfolgreich inaktiviert.

source: set inactive
de: inaktiv setzen

source: Users were successfully made to tutors.
de: Benutzer wurden erfolgreich zu Tutoren gemacht.

source: set tutor
de: zum Tutor machen

source: All users were successfully distributed.
de: Alle Benutzer wurden erfolgreich verteilt.

source: distribute to tutorials
de: Auf Lehrgänge verteilen

source: export users
de: Benutzer exportieren

source: <a href="{1}">Solutions by {0}</a> • <a href="{2}">Attestations for {0}</a> • <a href="{3}">Attestations by {0}</a>
de: <a href="{1}">Lösungen von {0}</a> • <a href="{2}">Bescheinigungen für {0}</a> • <a href="{3}">Bescheinigungen von {0}</a>

source: Useful Links
de: Nützliche Links

source: The user "%s" was automatically made staff member and superuser (because he was made a trainer)
de: Der Benutzer "%s" wurde automatisch zum Mitarbeiter und Superuser gemacht (weil er zum Trainer gemacht wurde)

source: <a href="%s">View</a>
de: <a href="%s">Ansicht</a>

source: View (Tutor Site)
de: Ansicht (Tutor-Seite)

source: First name
de: Vorname

source: Last name
de: Nachname

source: Email
de: E-Mail-Adresse

source: This field is required
de: Dieses Feld muss ausgefüllt werden

source: Only ASCII characters are allowed!
de: Nur ASCII-Zeichen sind erlaubt!

source: The email you have provided is not valid. It has to be in:
de: Die von Ihnen angegebene E-Mail ist nicht gültig. Sie muss dem folgenden Muster entsprechen:

source: This field is required.
de: Dieses Feld muss ausgefüllt werden.

source: A user with this number is already registered. Please contact a trainer: %s
de: Ein Benutzer mit dieser Nummer ist bereits registriert. Bitte kontaktieren Sie einen Trainer: %s

source: Account activation on
de: Kontoaktivierung auf %s

source: for
de: für

source: Account activation on %s
de: Kontoaktivierung auf %s

source: {% autoescape off %} You're receiving this e-mail because you have been registered at {{ site_name }}. Please go to the following page to activate your account within {{ expiration_days }} days. {{ protocol }}://{{ domain }}{% url registration_activate activation_key=activation_key %} Your username, in case you've forgotten: {{ user.username }} Thanks for using our site! The {{ site_name }} team {% endautoescape %}
de: {% autoescape off %} Sie erhalten diese E-Mail, weil Sie unter {{ site_name }} registriert sind. Bitte gehen Sie auf die folgende Seite, um Ihr Konto innerhalb von {{ expiration_days }} Tagen zu aktivieren. {{ protocol }}://{{ domain }}{% url registration_activate activation_key=activation_key %} Ihr Benutzername, falls Sie ihn vergessen haben: {{ user.username }} Vielen Dank für die Nutzung unserer Website! Das Team {{ site_name }} {% endautoescape %}

source: The file exported from the list view. Already existing users will be ignored.
de: Die aus der Listenansicht exportierte Datei. Bereits vorhandene Benutzer werden ignoriert.

source: File
de: Datei

source: Deactivate all imported users
de: Deaktivieren Sie alle importierten Benutzer

source: Require Reactivation
de: Benötigt Reaktivierung

source: Send activation email to imported users (if deactivated during import)
de: Aktivierungs-E-Mail an importierte Benutzer senden (falls beim Import deaktiviert)

source: Send reactivation mail
de: Sende Reaktivierungs-Mail

source: Message to be embedded into activation mail if reactivation is required.
de: Nachricht, die in die Aktivierungs-E-Mail eingebettet wird, wenn eine Reaktivierung erforderlich ist.

source: Messagetext
de: Nachrichtentext

source: The csv file containing the tutorial name and the students' mat number.
de: Die csv-Datei, die den Namen des Lehrgangs und die Matrikelnummer der Studenten enthält.

source: csv-File
de: CSV-Dateien

source: A one-character string used to separate fields.
de: Eine einstellige Zeichenfolge, die zur Trennung von Feldern verwendet wird.

source: Delimiter
de: Begrenzungszeichen

source: A one-character string used to quote fields.
de: Eine einstellige Zeichenfolge, die zum Anführen von Feldern verwendet wird.

source: The index of the field containing the name of the tutorial.
de: Der Index des Feldes, das den Namen des Lehrgangs enthält.

source: Name column
de: Namensspalte

source: The index of the field containing the mat number of the user.
de: Der Index des Feldes, das die Matrikelnummer des Benutzers enthält.

source: Mat column
de: Matrikelnummernspalte

source: A text file consisting of one matriculation number per line.
de: Eine Textdatei, die aus einer Matrikelnummer pro Zeile besteht.

source: Mat number file
de: Matrikelnummerdatei

source: Also remove all users from the group if they are not listed here.
de: Entfernen Sie auch alle Benutzer aus der Gruppe, wenn sie hier nicht aufgeführt sind.

source: Remove others
de: Entfernen andere

source: If a matriculation number is not known yet, create a stub user object
de: Wenn eine Matrikelnummer noch nicht bekannt ist, legen Sie ein Stub User Object an

source: Create users
de: Benutzer erstellen

source: You need to accept the disclaimer before using the site.
de: Sie müssen der Erklärung zustimmen, bevor Sie die Website nutzen.

source: Accept disclaimer
de: Erklärung akzeptieren

source: This is not a valid student number.
de: Dies ist keine gültige Studentennummer.

source: The tutorial the student belongs to.
de: Lehrgang, zu dem der Student gehört.

source: Tutorial
de: Lehrgang

source: Mat number
de: Matrikelnummer

source: The final grade for the whole class.
de: Die Endnote für den gesamten Kurs.

source: Final Grade
de: Endbewertung

source: The programme the student is enlisted in.
de: Das Programm, in das der Studierende eingeschrieben ist.

source: Programme
de: Programm

source: activation key
de: Aktivierungsschlüssel

source: Custom text which will be shown to this student.
de: Benutzerdefinierter Text, der diesem Studenten angezeigt wird.

source: User text
de: Benutzertext

source: Whether the user accepted the disclaimer.
de: Gibt an, ob der Benutzer den Haftungsausschluss akzeptiert hat.

source: User
de: Benutzer

source: Users
de: Benutzer

source: The name of the tutorial
de: Der Name des Lehrgangs

source: The tutors in charge of the tutorial.
de: Die für den Lehrgang verantwortlichen Tutoren.

source: Tutorials
de: Lehrgang

source: Tutors
de: Tutoren

source: The import was successfull. %i users imported.
de: Der Import war erfolgreich. %i Benutzer importiert.

source: An Error occured. The import file was probably malformed.
de: Es ist ein Fehler aufgetreten. Die Importdatei war wahrscheinlich fehlerhaft.

source: Import User
de: Benutzer importieren

source: Solution
de: Lösung

source: No Solutionfile exists by id
de: Es existiert keine Lösungsdatei mit der ID

source: The Name of the rating scale for the aspects. E.g.: "School marks"
de: Der Name der Bewertungsskala für die Aspekte. Z.B: "Schulnoten"

source: The first RatingScaleItem to generate.
de: Das erste zu erstellende Element der Bewertungsskala.

source: The last RatingScaleItem to generate.
de: Das letzte zu erstellende Element der Bewertungsskala.

source: End
de: Ende

source: The step size between the RatingScaleItems.
de: Die Schrittgröße zwischen den Elementen der Ratingskala.

source: Step
de: Schrittweite

source: Attestation
de: Bescheinigung

source: Attestations
de: Bescheinigungen

source: created
de: Erstellt

source: solution
de: Lösungen

source: attestation author
de: Bescheinigungsautor

source: Comment which is shown to the user.
de: Kommentar, der dem Benutzer angezeigt wird.

source: Public Comment
de: Öffentliches Kommentar

source: Comment which is only visible to tutors
de: Kommentar, der nur für die Tutoren sichtbar ist

source: Private Comment
de: Privates Kommentar

source: The mark for the whole solution.
de: Die Note für die gesamte Lösung.

source: Finale Grade
de: Endbewertung

source: Indicates whether the attestation is ready to be published
de: Zeigt an, ob die Bescheinigung zur Veröffentlichung bereit ist

source: Indicates whether the user can see the attestation.
de: Gibt an, ob der Benutzer die Bescheinigung sehen kann.

source: published
de: veröffentlicht

source: The Date/Time the attestation was published.
de: Datum/Uhrzeit, zu der die Bescheinigung veröffentlicht wurde.

source: published on
de: veröffentlicht am

source: New attestation for your solution of the task '%s'
de: Neue Bescheinigung für Ihre Lösung der Aufgabe '%s'

source: Attestation for your solution of the task '%s' withdrawn
de: Bescheinigung für Ihre Lösung der Aufgabe '%s' zurückgezogen

source: Annotated solution file
de: Kommentierte Lösungsdateien

source: Annotated solution files
de: Kommentierte Lösungsdateien

source: The content of the solution file annotated by the tutor.
de: Der Inhalt der Lösungsdatei wird vom Tutor kommentiert.

source: Rating Aspect
de: Bewertungsaspekte

source: Rating Aspects
de: Bewertungsaspekte

source: The Name of the Aspect to be rated. E.g.: "Readability"
de: Der Name des zu bewertenden Aspekts. Z.B: "Lesbarkeit".

source: Description of the Aspect and how it should be rated. E.w.: "How well is the code structured?"
de: Beschreibung des Aspekts und wie er bewertet werden sollte. Z.B.: "Wie gut ist der Code strukturiert?"

source: Description
de: Beschreibung

source: Rating Scale
de: Bewertungsskalen

source: Rating Scales
de: Bewertungsskalen

source: Rating Scale Item
de: Gegenstand der Bewertungsskala

source: Rating Scale Items
de: Gegenstände der Bewertungsskala

source: The Name of the item(mark) in the rating scale. E.g.: "A" or "very good"
de: Der Name des Items (der Note) in der Bewertungsskala. Z.B: "A" oder "sehr gut"

source: Defines the order in which the items are sorted. Lowest is best.
de: Legt die Reihenfolge fest, in der die Artikel sortiert werden. Die niedrigste ist die beste.

source: Rating
de: Bewertungen

source: Ratings
de: Bewertungen

source: Task
de: Aufgabe

source: Rating result
de: Bewertungs Ergebniss

source: Rating results
de: Bewertungs Ergebnisse

source: Scripts
de: Scripte

source: This JavaScript will calculate a recommend end note for every user based on final grade of every task.
de: Dieses JavaScript berechnet eine empfohlene Endnote für jeden Benutzer auf der Basis von Endnote pro Aufgabe.

source: Final Grades for Students in Tutorial %s
de: Abschlussbewertung für Studenten im Lehrgang %s

source: This chart shows the distribution of final grades for students from Tutorial %s. Plagiarism is excluded.
de: Dieses Diagramm zeigt die Verteilung der Abschlussbewertungen für Studenten aus dem Lehrgang %s. Plagiate sind ausgeschlossen.

source: Final Grades for Attestations created by %s
de: Endbewertungen für Bescheinigungen, die von %s

source: This chart shows the distribution of final grades for Attestations created by %s. Plagiarism is excluded.
de: Dieses Diagramm zeigt die Verteilung der Endbewertungen für die erstellten Bescheinigungen nach %s. Plagiate sind ausgeschlossen.

source: Final grades (My Tutorials)
de: Abschlussbewertungen (Meine Lehrgänge)

source: This chart shows the distribution of final grades for students from any of your tutorials. Plagiarism is excluded.
de: Dieses Diagramm zeigt die Verteilung der Endbewertungen für die Studentinnen und Studenten aus einem Ihrer Lehrgänge. Plagiate sind ausgeschlossen.

source: Final grades (My Attestations)
de: Meine Bescheinigungen

source: This chart shows the distribution of final grades for your attestations. Plagiarism is excluded.
de: Dieses Diagramm zeigt die Verteilung der Endbewertungen für Ihre Bescheinigungen. Plagiate sind ausgeschlossen.

source: Final grades (overall)
de: Endbewertungen (insgesamt)

source: This chart shows the distribution of final grades for all students. Plagiarism is excluded.
de: Dieses Diagramm zeigt die Verteilung der Abschlussbewertungen für alle Studierenden Plagiate ausgeschlossen.

source: Generate RatingScale
de: Bewertungsskala generieren

source: An Error occurred. The import file was probably malformed.: %s
de: Es ist ein Fehler aufgetreten. Die Importdatei war wahrscheinlich fehlerhaft.: %s

source: Edit
de: Bearbeiten

source: Edit (Admin Site)
de: Bearbeiten (Admin-Site)

source: View Solution (User Site)
de: Ansicht Lösung (Benutzerseite)

source: Solution Final
de: Lösung Final

source: Created
de: Erstellt

source: Determines the order in which the checker will start. Not necessary continuously!
de: Bestimmt die Reihenfolge, in der der Checker startet. Nicht ständig notwendig!

source: Order
de: Reihenfolge

source: Test results are displayed to the submitter.
de: Die Testergebnisse werden dem Einreicher angezeigt.

source: Public
de: Öffentlich

source: The test must be passed to submit the solution.
de: Der Test muss bestanden werden, um die Lösung einzureichen.

source: Required
de: Notwendig

source: The test will run on submission time.
de: Der Test wird bei Einreichung ausgeführt.

source: Always
de: Immer

source: If this test fails, do not display further test results.
de: Wenn dieser Test fehlschlägt, zeige keine weiteren Testergebnisse an.

source: Critical
de: Entscheidend

source: Checker is required, but failure isn't publicly reported to student during submission
de: Checker benötigt, aber das Versagen wird den Studenten bei der Einreichung nicht öffentlich mitgeteilt

source: Checker Result
de: Checker-Ergebniss

source: Checker Results
de: Checker-Ergebnisse

source: Content type
de: Inhaltstyp

source: Object Id
de: Objekt Id

source: Indicates whether the test has been passed
de: Zeigt an, ob die Prüfung bestanden wurde

source: Passed
de: Bestanden

source: Text result of the checker
de: Textergebnis des Checker

source: Log
de: Ausgabe

source: Creation Date
de: Erstellungsdatum

source: Runtime in milliseconds
de: Laufzeit in Millisekunden

source: Runtime
de: Laufzeit

source: <div class="error">Timeout occured!</div>
de: <div class="error">Zeitüberschreitung ist aufgetreten!</div>

source: <div class="error">Output too long, truncated</div>
de: <div class="error">Ausgabe zu lang, abgeschnitten</div>

source: <div class="error">Memory limit exceeded, execution cancelled.</div>
de: <div class="error">Speichergrenze überschritten, Ausführung abgebrochen.</div>

source: Artefact produced by a checker
de: Von einem Checker erstelltes Artefakt

source: The Checker caused an unexpected internal error.
de: Der Checker verursachte einen unerwarteten internen Fehler.

source: Ensure anonymous submission
de: Anonyme Einreichung sicherstellen

source: This check fails if a submitted file contains your first or last name.
de: Diese Prüfung schlägt fehl, wenn eine eingereichte Datei Ihren Vor- oder Nachnamen enthält.

source: The file contains your name or user id:
de: Die Datei enthält Ihren Namen oder Ihre Benutzerkennung:

source: <p>Praktomat supports <em>anonymous marking</em>, i.e. the person who marks only sees your submission, but not your name or identity. To allow anonymous marking, your name and user id is not allowed to appear in your submission.<p> Please remove your name and user id and submit again.
de: <p>Praktomat unterstützt <em>anonyme Beurteilung</em>, d.h. die Person, die beurteilt, sieht nur Ihre Einreichung, aber nicht Ihren Namen oder Identität. Um eine anonyme Beurteilung zu ermöglichen, dürfen Ihr Name und Ihre Benutzerkennung nicht erscheinen in Ihrer Einreichung. <p> Bitte entfernen Sie Ihren Namen und Ihre Benutzerkennung und reichen Sie sie erneut ein.

source: The fully qualified name of the test case executable (with file ending like .exe or .out)
de: Der vollqualifizierte Name des Testfalls (mit der Dateiendung .exe oder .out)

source: TestApp Filename
de: Teatanwendungsdateiname

source: Regular Expression for ignoring files while compile and link test-code.
de: Regulärer Ausdruck zum Ignorieren von Dateien beim Kompilieren und Verknüpfen von Testcode.

source: Compiler and Linker flags for i.e. libraries used while generating TestApp. <br> Don't fill in cunit or cppunit here.
de: Compiler- und Linker-Flags für z.B. Bibliotheken, die beim Generieren von TestApp verwendet werden.<br>Füllen Sie hier keine cunit oder cppunit aus.

source: How to use solution submission in test-code?
de: Wie verwendet man die Lösungsübermittlung im Testcode?

source: Unittest type or library
de: Unittest-Typ oder Bibliothek

source: Command line parameters for running TestApp
de: Befehlszeilenparameter für die Ausführung von TestApp

source: Description of the Testcase. To be displayed on Checker Results page when checker is unfolded.
de: Beschreibung des Testfalls. Wird auf der Checker-Ergebnisseite angezeigt, wenn der Checker ausgeklappt wird.

source: Name of the Testcase. To be displayed as title on Checker Results page
de: Name des Testfalls. Wird als Titel auf der Seite mit den Checker-Ergebnissen angezeigt

source: base filename ( = filename without file ending!) for interaction with MUT (Module-Under-Test)<br>The file ending to use gets determined by your chosen Link type.<br>
de: Basisdateiname ( = Dateiname ohne Dateiende!) für die Interaktion mit MUT (Module-Under-Test)<br>Die zu verwendende Dateiendung wird durch den gewählten Linktyp bestimmt.<br>

source: MUT Filename
de: MUT Dateiname

source: Regular Expression for ignoring files while compile CUT and link MUT.<br>CUT = Code Under Test - MUT = Module Under Test <br>Play with RegEx at <a href="http://pythex.org/" target="_blank">http://pythex.org/ </a>
de: Regulärer Ausdruck zum Ignorieren von Dateien beim Kompilieren von CUT und Link MUT.<br>CUT = Code im Test - MUT = Modul im Test<br>Spielen Sie mit RegEx auf <a href="http://pythex.org/" target="_blank">http://pythex.org/</a>

source: MUT ignore files
de: MUT-Dateien ignorieren

source: Compiler and Linker flags used while generating MUT (Module-under-Test).
de: Compiler und Linker Flags nutzen für die Generierung des MUT (Module-under-Test)

source: You should check "Filename" value. The correct name could be:
de: Überprüfen Sie den Wert "Dateiname". Der korrekte Name könnte z.B. sein:

source: Name to be displayed on the solution detail page.
de: Name, der auf der Seite der Lösungen angezeigt werden soll.

source: XML configuration of CheckStyle. See https://github.com/checkstyle/checkstyle
de: XML-Konfiguration von CheckStyle. Siehe https://github.com/checkstyle/checkstyle

source: Configuration
de: Konfiguration

source: Runs checkstyle (https://github.com/checkstyle/checkstyle).
de: Führt CheckStyle aus (https://github.com/checkstyle/checkstyle).

source: The file that is copied into the sandbox
de: Die Datei, die in die Sandbox kopiert wird

source: What the file will be named in the sandbox. If empty, we try to guess the right filename!
de: Wie die Datei in der Sandbox benannt wird. Wenn sie leer ist, versuchen wir, den richtigen Dateiname zu erraten!

source: Filename
de: Dateiname

source: Subfolder in the sandbox which shall contain the file.
de: Unterordner in der Sandbox, der die Datei enthalten soll.

source: Path
de: Pfad

source: Unpack the zip file into the given subfolder. (It will be an error if the file is not a zip file; the filename is ignored.)
de: Entpacken Sie die Zip-Datei in den angegebenen Unterordner. (Es ist ein Fehler, wenn die Datei keine Zip-Datei ist; der Dateiname wird ignoriert)

source: Unpack Zip File
de: Entpacke Zip-Datei

source: The file is (or, if it is a zipfile to be unpacked: contains) source code
de: Die Datei ist (oder, wenn es sich um eine zu entpackende Zip-Datei handelt: enthält) Quellcode

source: is Sourcecode
de: Ist Quellcode

source: The file is (or, if it is a zipfile to be unpacked: its content) is included in "full" solution download .zip files
de: Die Datei ist (oder, wenn es sich um eine zu entpackende Zip-Datei handelt: ihr Inhalt) beinhaltet in der "full" Lösungen Zip-Datei zum herunterladen

source: Include in solution download
de: Einfügen in Lösungs-Download

source: These files already existed. Do NOT include them in your submissions:<br/><ul>
de: Diese Dateien existierten bereits. Fügen Sie diese NICHT in Ihren Einreichungen mit ein:<br/><ul>

source: Copy File
de: Kopiere Datei

source: The name of the Test
de: Der Name des Tests

source: <pre><b class="fail">Error</b>: Path to the main() - source file contains spaces. For Java .zip submissions, the directory hierarchy of the .zip file must exactly match the package structure. The default package must correspond to the .zip root directory.</pre>
de: <pre><b class="fail">Fehler</b>: Pfad zur main() - Quelldatei enthält Leerzeichen. Bei Java .zip-Einreichungen muss die Verzeichnishierarchie der .zip-Datei genau mit der Paketstruktur übereinstimmen. Das default Package muss dem .zip-Stammverzeichnis entsprechen.</pre>

source: Test Defs
de: Testdefinitionen

source: The shell script whose output for the given input file is compared to the given output file: The substrings JAVA and PROGRAM got replaced by Praktomat determined values.
de: Das Shell-Skript, dessen Ausgabe für die angegebene Eingabedatei mit der angegebenen Ausgabedatei verglichen wird: Die Teilzeichenfolgen JAVA und PROGRAM wurden durch Praktomat ermittelte Werte ersetzt.

source: The file containing the input for the program.
de: Die Datei enthält die Eingabe für das Programm.

source: Input File
de: Eingabedatei

source: The file containing the output for the program.
de: Die Datei enthält die Ausgabe für das Programm.

source: Output File
de: Ausgabedatei

source: Robert says: DiffChecker have to have an Shell script, an Inputfile and an Outputfile
de: Robert sagt: DiffChecker müssen ein Shell-Skript, eine Inputfile und eine Outputfile haben

source: Description of the Testcase. To be displayed on Checker Results page when checker is unfolded.
de: Beschreibung des Testfalls. Wird auf der Seite mit den Checker-Ergebnissen angezeigt, wenn der Checker ausgeklappt wird.

source: Test Description
de: Testbeschreibung

source: space-separated list of files to be ignored during compilation
de: durch Leerzeichen getrennte Liste von Dateien, die bei der Kompilierung ignoriert werden

source: Ignore
de: Ignorieren

source: Is a submission required to be Safe (according to GHCs Safe-Mode)?
de: Ist eine Einreichung erforderlich, um sicher zu sein (gemäß GHCs Safe-Mode)?

source: Require Safe
de: Erfordert Sicherheit

source: Download-Link only
de: Nur Download-Link

source: Do not make the testcases source available
de: Quelle der Testfälle nicht zur Verfügung stellen

source: Also copy the source into the report
de: Kopiere auch die Quelle in den Bericht

source: Make the testcases source available via the checkers result report?
de: Die Testfälle über den Ergebnisbericht des Checkers zur Verfügung stellen?

source: Include in Report
de: In den Bericht integrieren

source: This Checker runs a test-framework testcase existing in the sandbox. You may want to use CreateFile Checker to create test-framework .hs and possibly input data files in the sandbox.
de: Dieser Checker führt einen Testframework-Testfall aus, der in der Sandbox vorhanden ist. Sie können CreateFile Checker verwenden, um test-framework .hs zu erstellen und möglicherweise Datendateien in die Sandbox einzugeben.
