Repository: schlom/Praktomat-1
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: The import was successful.
de: Der Import war erfolgreich.

source: An Error occured. The import file was probably malformed: %s
de: Es ist ein Fehler aufgetreten. Die Importdatei war wahrscheinlich fehlerhaft: %s

source: Error 404
de: Fehler 404

source: <p>"%(request_path)s" could not be found.</p>
de: <p>"%(request_path)s" konnte nicht gefunden werden.</p>

source: Error 500
de: Fehler 500

source: <p>Internal Server Error.</p>
de: <p>Interner Server-Fehler.</p>

source: Access denied
de: Zutritt verweigert

source: <p>You don't have the permission to access %(request_path)s.</p>
de: <p>Sie haben nicht die Berechtigung für den Zugriff auf %(request_path)s.</p>

source: Import tutorial assignment
de: Lehrgangszuordnung importieren

source: Import user texts
de: Benutzertexte importieren

source: Add %(name)s
de: %(name)s hinzufügen

source: Home
de: Start

source: Accounts
de: Konten

source: Please correct the error below.
de: Bitte den unten aufgeführten Fehler korrigieren.

source: Save
de: Speichern

source: Generate %(name)s
de: %(name)s erzeugen

source: Rating scales
de: Bewertungsskalen

source: Generate ratingScale
de: Bewertungsskala generieren

source: Update Attestations
de: Bescheinigungen aktualisieren

source: Assign by matriculation number
de: Zuordnung nach Matrikelnummer

source: History
de: Verlauf

source: View on site
de: Auf der Website anzeigen

source: Group
de: Gruppe

source: Import matriculation list
de: Importieren der Immatrikulationsliste

source: Praktomat admin: %(title)s
de: Praktomat-Verwaltung: %(title)s

source: %(SITE_NAME)s: Admin
de: %(SITE_NAME)s: Verwaltung

source: User site
de: Benutzerseite

source: Add another %(verbose_name)s
de: %(verbose_name)s hinzufügen

source: Download Final Solutions
de: Finale Lösungen herunterladen

source: Save this task to add a model solution
de: Speichern Sie diese Aufgabe, um eine Musterlösung hinzuzufügen

source: Add
de: Hinzufügen

source: model solution
de: Musterlösung

source: Checker results
de: Checker-Ergebnisse

source: Files
de: Dateien

source: not finished
de: nicht abgeschlossen

source: final but unpublished
de: endgültig, aber unveröffentlicht

source: final and published
de: endgültig und veröffentlicht

source: view only
de: nur anzeigen

source: There already are Attestations for the
de: Es gibt bereits Bescheinigungen für die

source: specified solution
de: bestimmte Lösung

source: . Do you want to
de: . Wollen Sie

source: force the creation
de: die Erstellung erzwingen

source: of another Attestation?
de: einer anderen Bescheinigung?

source: Existing Attestationss
de: Vorhandene Bescheinigungen

source: Attestation for
de: Bescheinigung für

source: Solution
de: Lösung

source: by
de: von

source: Marked as Plagiarism
de: Als Plagiat markiert

source: Created:
de: Erstellt:

source: Save/Preview
de: Speicher/Vorschau

source: Discard/Back
de: Verwerfen/Zurück

source: Solution by:
de: Lösung von:

source: Model solution
de: Musterlösung

source: Annotate solution files
de: Kommentierte Lösungsdateien

source: Attest solution
de: Bescheinigte Lösungen

source: Download
de: Herunterladen

source: Download (incl. checker files)
de: Download (inkl. Checker-Dateien)

source: re-run all checkers
de: Alle Checker nochmal starten

source: Editor Options
de: Optionen für den Editor

source: word wrap
de: Zeilenumbruch

source: Hello
de: Hallo

source: your solution to the task "%(task)s" has been attested.
de: Ihre Lösung der Aufgabe "%(task)s" wurde bescheinigt.

source: your solution to the task "%(task)s" has been attested by %(by)s.
de: Ihre Lösung der Aufgabe "%(task)s" wurde von %(by)s bescheinigt.

source: You can view your attestation here:
de: Sie können Ihre Bescheinigung hier einsehen:

source: Thanks for using our site!
de: Vielen Dank, dass Sie unsere Website benutzen!

source: The %(site_name)s team
de: Das %(site_name)s-Team

source: Are you sure?
de: 'Sind Sie sicher?'

source: Really publish all final attestations?
de: 'Wirklich alle Abschlussbescheinigungen veröffentlichen?'

source: Upload a test solution
de: Testlösung hochladen

source: Download all solutions
de: Alle Lösungen herunterladen

source: Download all solutions, including checker files
de: Laden Sie alle Lösungen herunter, einschließlich Checker-Dateien

source: Upload solutions in a students name
de: Lösungen im Namen eines Studenten hochladen

source: Edit Solutions
de: "Lösungen editieren"

source: The task is not yet expired.
de: Die Aufgabe ist noch nicht abgelaufen.

source: Not all checker have yet been run.
de: Es wurden noch nicht alle Prüfungen durchgeführt.

source: Attestation Progress
de: Bescheinigungsfortschritt

source: solutions to attest.
de: Lösungen zum bescheinigen.

source: Attest next solution
de: "Bescheinige nächste Lösungen"

source: Attestation Progress by Tutor
de: Bescheinigung des Fortschritts durch den Tutor

source: Unrated
de: Nicht bewertet

source: Not final
de: Nicht endgültig

source: Total
de: Insgesamt

source: Unattested solutions
de: Unbescheinigte Lösungen

source: All solutions have been attested.
de: Alle Lösungen wurden bescheinigt.

source: Attest selected user
de: "Bescheinige ausgewählten Benutzer"

source: The solutions of
de: Die Lösungen von

source: have been marked as plagiarism.
de: wurde als Plagiat markiert.

source: solutions have been marked as plagiarism.
de: Lösungen wurden als Plagiat gekennzeichnet.

source: My attestations
de: Meine Bescheinigungen

source: Attestations by other tutors
de: Bescheinigungen von anderen Tutoren

source: by
de: von

source: Created:
de: Erstellt:

source: "Publish %(c)s final attestation%(c|pluralize)s from my tutorial"
de: "Veröffentlichen Sie %(c)s Abschlussbescheinigung%(c|pluralize)s aus meinem Lehrgang"

source: All attestations
de: Alle Bescheinigungen

source: "Publish %(c)s final attestation%(c|pluralize)s from this task"
de: "Veröffentlichen Sie %(c)s Abschlussbescheinigung%(c|pluralize)s von dieser Aufgabe"

source: Really withdraw this attestion? The student and the trainers will be notified by e-mail.
de: Diese Bescheinigung wirklich zurücknehmen? Der Student und die Ausbilder werden per E-Mail benachrichtigt.

source: Preview
de: Vorschau

source: My solutions
de: Meine Lösungen

source: Comment
de: Kommentar

source: Final grade:
de: Endbewertungen:

source: Annotated Files
de: Kommentierte Dateien

source: Download Solution
de: Lösung herunterladen

source: Original Files
de: Ursprüngliche Dateien

source: Save and publish
de: "Speichern und veröffentlichen"

source: Edit again
de: "Erneut bearbeiten"

source: Withdraw published attestation
de: "Veröffentlichte Bescheinigung zurückziehen"

source: the attestation of your solution to the task "%(task)s" has been withdrawn by %(by)s.
de: die Bescheinigung Ihrer Lösung der Aufgabe "%(task)s" wurde von %(by)s zurückgezogen.

source: Rating Overview
de: Bewertungsübersicht

source: The
de: Das

source: of all grades
de: aller Bewertungen

source: plagiarism grades will be calculated as the final grades.
de: Plagiatsbewertungen werden als Endbewertung berechnet.

source: Calculate
de: Berechne

source: MatrNo
de: MatrNr

source: Calculated grade
de: Berechnete Bewertung

source: Final grade
de: Endbewertungen

source: Threshold
de: Schwelle

source: Warning
de: Warnung

source: take all
de: alle übernehmen

source: Save Final Grades
de: "Endbewertungen speichern"

source: Email all users
de: E-Mail an alle Teilnehmern

source: Email to users with warnings
de: E-Mail an Benutzer mit Warnungen

source: Export as csv (utf-8)
de: Als csv exportieren (utf-8)

source: Statistics
de: Statistiken

source: Shows the dates on which solution submissions were made. Final submissions indicate when users uploaded their newest solution. Total submissions shows the percentage of active users who have submitted at least one solution.
de: Zeigt die Daten, für die Lösungsvorschläge eingereicht wurden. Die endgültigen Eingaben zeigen an, wann die Benutzer ihre neueste Lösung hochgeladen haben. Die Gesamtzahl der Einreichungen zeigt den Prozentsatz der aktiven Benutzer, die mindestens eine Lösung eingereicht haben.

source: This chart plots on which time of day the users were most active.
de: Dieses Diagramm stellt dar, zu welcher Tageszeit die Benutzer am aktivsten waren.

source: This chart gives an overview of how many attestations are ready to be published and how many of these are already published by the tutors.
de: Diese Tabelle gibt einen Überblick darüber, wie viele Bescheinigungen zur Veröffentlichung bereit sind und wie viele davon bereits von den Tutoren veröffentlicht wurden.

source: Shows the time it took to process each of the checkers.
de: Zeigt die Zeit an, die für die Bearbeitung der einzelnen Checker benötigt wurde.

source: No Tutorial
de: Kein Lehrgang

source: You don't supervise any Tutorial.
de: Sie beaufsichtigen keinen Lehrgang.

source: Other Tutorials
de: Andere Lehrgänge

source: Marked as plagiarism
de: Als Plagiat markiert

source: Average:
de: Durchschnitt:

source: Welcome,
de: Willkommen,

source: View Account
de: Konto anzeigen

source: Change Account
de: Konto wechseln

source: Log-out
de: Abmelden

source: Rating overview
de: Bewertungsübersicht

source: Admin Panel
de: Admin-Bereich

source: My Tutorial
de: Mein Lehrgang

source: Login
de: Anmeldung

source: Register
de: Registrierung

source: <strong>Warning:</strong> This site is designed to use Javascript! Enabling it is advised.</p>
de: <strong>Warnung:</strong> Diese Website ist für die Verwendung von Javascript ausgelegt! Es wird empfohlen, es zu aktivieren. </p>

source: Compiler output:
de: Kompiler-Ausgabe:

source: The Compiler produced no messages.
de: Der Kompiler erzeugte keine Meldungen.

source: No Input files matching
de: Keine übereinstimmenden Eingabedateien

source: found.
de: gefunden.

source: User-submitted files found for Compilation:
de: Von Benutzern eingereichte Dateien für die Kompilierung gefunden:

source: user-submitted files found for compilation:
de: von Benutzern eingereichte Dateien zur Kompilierung gefunden:

source: Java compiler output:
de: Java-Compiler-Ausgaben:

source: The Java compiler produced no messages.
de: Der Java-Compiler erzeugte keine Meldungen.

source: No Java input files found.
de: Keine Java-Eingabedateien gefunden.

source: Accept Disclaimer
de: Erklärung akzeptieren

source: Before using this site, you have to accept the following disclaimer:
de: Bevor Sie diese Website nutzen, müssen Sie die folgende Erklärung akzeptieren:

source: Registration
de: Registrierung

source: Retrieve password
de: Passwort wiederherstellen

source: Password change
de: Passwort ändern

source: Password change successful
de: Passwortänderung erfolgreich

source: Your password was changed.
de: Ihr Passwort wurde geändert.

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
de: Bitte geben Sie aus Sicherheitsgründen Ihr altes Passwort ein und geben Sie dann zweimal Ihr neues Passwort ein, damit wir überprüfen können, ob Sie es richtig eingegeben haben.

source: Old password:
de: Altes Passwort:

source: New password:
de: Neues Passwort:

source: Confirm password:
de: Passwort bestätigen:

source: Change my password
de: Mein Passwort ändern

source: Password reset
de: Passwort zurücksetzen

source: Password reset complete
de: Passwort zurückgesetzt

source: Your password has been set. You may go ahead and log in now.
de: Ihr Passwort wurde festgelegt. Sie können sich nun anmelden.

source: Log in
de: Anmelden

source: Enter new password
de: Neues Passwort eingeben

source: Please enter your new password twice so we can verify you typed it in correctly.
de: Bitte geben Sie Ihr neues Passwort zweimal ein, damit wir überprüfen können, ob Sie es korrekt eingegeben haben.

source: Password reset unsuccessful
de: Passwort zurücksetzen erfolglos

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
de: Der Link zum Zurücksetzen Ihres Passworts ist ungültig, wahrscheinlich weil er schon einmal benutzt wurde. Bitte setzen Sie Ihr Passwort erneut zurück.

source: Password reset successful
de: Kennwortzurücksetzung erfolgreich

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
de: Wir haben Ihnen per E-Mail Anweisungen zur Einstellung Ihres Passworts an die von Ihnen angegebene E-Mail-Adresse geschickt. Sie sollten sie in Kürze erhalten.

source: You're receiving this e-mail because you requested a password reset
de: Sie erhalten diese E-Mail, weil Sie eine Passwortzurücksetzung beantragt haben

source: for your user account at %(site_name)s
de: für Ihr Benutzerkonto unter %(site_name)s

source: Please go to the following page and choose a new password:
de: Bitte öffnen Sie folgende Seite, um Ihr neues Passwort einzugeben:

source: Your username, in case you've forgotten:
de: Ihr Benutzername, falls Sie ihn vergessen haben:

source: Forgot your password? Enter your e-mail address below, and we'll e-mail instructions for setting a new one.
de: Haben Sie Ihr Passwort vergessen? Geben Sie unten Ihre E-Mail-Adresse ein, und wir senden Ihnen per E-Mail Anweisungen für die Festlegung eines neuen Passworts.

source: E-mail address:
de: Ihre E-Mail-Adresse:

source: Reset my password
de: Mein Passwort zurücksetzen

source: Activation
de: Aktivierung

source: Activation successful,Activation unsuccessful
de: Aktivierung erfolgreich, Aktivierung nicht erfolgreich

source: You have successfully activated your account. You can now login.
de: Sie haben Ihr Konto erfolgreich aktiviert. Sie können sich nun einloggen.

source: Your activation has failed due to one of the folloing reasons:
de: Ihre Aktivierung ist aus einem der folgenden Gründe fehlgeschlagen:

source: The activation period of %(expiration_days)s days has expired.
de: Die Aktivierungsperiode von %(expiration_days)s Tagen ist abgelaufen.

source: The activation code was already successfully used. You may try to log in.
de: Der Aktivierungscode wurde bereits erfolgreich verwendet. Sie können versuchen, sich anzumelden.

source: The activation code is invalid.
de: Der Aktivierungscode ist ungültig.

source: An account with the same matnumber was already activated.
de: Ein Konto mit der gleichen Matrikelnummer wurde bereits aktiviert.

source: Activation enabled
de: Aktiviert akzeptiert

source: The user has received an e-Mail containing his activation code.
de: Der Benutzer hat eine E-Mail mit seinem Aktivierungscode erhalten.

source: Username:
de: Benutzername:

source: Matr. Number:
de: Matrikelnummer:

source: eMail Address:
de: E-Mail-Adresse:

source: Full Name:
de: Vollständiger Name:

source: Change Password
de: Passwort ändern

source: Matnumber:
de: Matrikelnummer:

source: save
de: speichern

source: Registration successful
de: Registrierung erfolgreich

source: We've e-mailed you instructions for activating your account to the e-mail address you submitted. You should be receiving it shortly.
de: Wir haben Ihnen Anweisungen zur Aktivierung Ihres Kontos per E-Mail an die von Ihnen angegebene E-Mail-Adresse geschickt. Sie sollten sie in Kürze erhalten.

source: Deactivated
de: Deaktiviert

source: You're receiving this e-mail because you registered an account at %(site_name)s
de: Sie erhalten diese E-Mail, weil Sie ein Konto bei %(site_name)s registriert haben

source: Please go to the following page to activate your account within %(expiration_days)s days
de: Bitte gehen Sie auf die folgende Seite, um Ihr Konto innerhalb von %(expiration_days)s Tagen zu aktivieren

source: A user has registered an account on %(site_name)s
de: Ein Benutzer hat ein Konto bei %(site_name)s registriert

source: If you want allow this user to activate his account, please visit the following page
de: Wenn Sie diesem Benutzer erlauben wollen, sein Konto zu aktivieren, besuchen Sie bitte die folgende Seite

source: Upon visiting that page, the user will be sent his activation key
de: Beim Besuch dieser Seite wird dem Benutzer sein Aktivierungsschlüssel zugeschickt

source: The %(site_name)s team will shortly validate your registration. You will then receive a mail with your activation key.
de: Das %(site_name)s-Team wird Ihre Anmeldung in Kürze bestätigen. Sie erhalten dann eine E-Mail mit Ihrem Aktivierungsschlüssel.

source: Register a new Account
de: Ein neues Konto registrieren

source: The username you choose will also be your public name for the forum and can not be changed after registration.
de: Der von Ihnen gewählte Benutzername wird auch Ihr öffentlicher Name für das Forum sein und kann nach der Registrierung nicht mehr geändert werden.

source: Registration is closed. Please Contact a Trainer:
de: Die Registrierung ist abgeschlossen. Bitte kontaktieren Sie einen Trainer:

source: or Administrator:
de: oder Administrator:

source: First name:
de: Vorname:

source: Last name:
de: Nachname:

source: Field of study:
de: Studienrichtung:

source: Your IdP is not releasing all the required attributes for this service.
de: Ihr IdP gibt nicht alle erforderlichen Attribute für diesen Dienst frei.

source: Login not allowed
de: Anmeldung nicht erlaubt

source: You are not known to the system, and automatic registration is turned off. Did you register with the course? If you think this is not your fault, please talk to your trainer.
de: Sie sind dem System nicht bekannt, und die automatische Registrierung ist ausgeschaltet. Haben Sie sich für den Kurs angemeldet? Wenn Sie glauben, dass dies nicht Ihre Schuld ist, sprechen Sie bitte mit Ihrem Ausbilder.

source: The submitted attributes are:
de: Die eingereichten Attribute sind:

source: Matrnumber
de: Matrikelnummer

source: Username
de: Benutzername

source: passed, failed
de: bestanden, nicht bestanden

source: The following artefacts were produced:
de: Die folgenden Artefakte wurden hergestellt:

source: View
de: Ansicht

source: jPlag output
de: jPlag Ausgabe

source: jPlag results
de: jPlag Ergebnisse

source: jPlag log file
de: jPlag-Log-Datei

source: Open jPlag output in new window
de: Öffnen Sie die jPlag-Ausgabe in einem neuen Fenster

source: Re-run jPlag
de: jPlag erneut ausführen

source: Run jPlag
de: Starte jPlag

source: Warning: jPlag output not up-to-date with regard to final solutions.
de: Warnung: Die jPlag-Ausgabe ist im Hinblick auf die endgültigen Lösungen nicht aktuell.

source: Warning: The last jPlag run did not produce any output.
de: Warnung: Der letzte jPlag-Durchlauf hat keine Ausgabe erzeugt.

source: jPlag has not yet run.
de: jPlag ist noch nicht gelaufen.

source: This Praktomat instance has no integrated jPlag support. Please download the jPlag jar file and configure the <code>JPLAGJAR</code> setting.
de: Diese Praktomat-Instanz hat keine integrierte jPlag-Unterstützung. Bitte laden Sie die jPlag-Jar-Datei herunter und konfigurieren Sie die Einstellung <code>JPLAGJAR</code>.

source: %(solution.author)s's solutions
de: Lösungen von %(solution.author)s

source: (as seen by %(solution.author)s,
de: (aus der Sicht von %(solution.author)s,

source: also show non-public checker results
de: auch nicht-öffentliche Prüfergebnisse anzeigen

source: All required tests have been passed. Nevertheless there is at least one warning
de: Alle erforderlichen Tests wurden bestanden. Dennoch gibt es mindestens eine Warnung

source: You should consider correcting it.
de: Sie sollten erwägen, dies zu korrigieren.

source: All required tests have been passed.
de: Alle erforderlichen Tests wurden bestanden.

source: Not all required tests have been passed.
de: Es wurden nicht alle erforderlichen Tests bestanden.

source: Please correct the errors below and try again!
de: Bitte korrigieren Sie die untenstehenden Fehler und versuchen Sie es erneut!

source: This is a test submission, and otherwise ignored.
de: Dies ist eine Testeinreichung und wird ansonsten ignoriert.

source: This is your current final solution.
de: Dies ist Ihre derzeitige Endlösung.

source: This is NOT your current final solution.
de: Dies ist NICHT Ihre derzeitige endgültige Lösung.

source: Resubmit
de: Erneut einreichen

source: You can resubmit this solution to make this your final solution.
de: Sie können diese Lösung erneut einreichen, um dies zu Ihrer endgültigen Lösung zu machen.

source: Results
de: Ergebnisse

source: (The preview requires iframe support)
de: (Die Vorschau erfordert Iframe-Unterstützung)

source: solutions
de: Lösungen

source: (as seen by
de: (aus der Sicht von

source: Time left:
de: Verbleibende Zeit:

source: Upload solution
de: Lösung hochladen

source: upload
de: hochladen

source: The deadline has passed. Therefore (re)submission is not possible.
de: Die Frist ist abgelaufen. Eine (Wieder-)Einreichung ist daher nicht möglich.

source: Errors
de: Fehler

source: No Warnings
de: Keine Warnungen

source: Attest
de: Bescheinigung

source: Final Solution
de: Endgültige Lösung

source: There is no final solution.
de: Es gibt keine endgültige Lösung.

source: Solution History
de: Übersicht der Lösungen

source: No solutions have been uploaded.
de: Es wurden keine Lösungen hochgeladen.

source: Please wait while your solution is examined.
de: Bitte warten Sie, während Ihre Lösung geprüft wird.

source: ago
de: vor kurzem

source: test submission
de: Testeinreichung

source: Test Solution Upload
de: Testlösung hochladen

source: a
de: ein

source: your
de: ihr

source: solution to the task "%(solution.task)s" has been successfully uploaded
de: Die Loesung der Aufgabe "%(solution.task)s" wurde erfolgreich hochgeladen

source: in your name by trainer %(uploader)s
de: in Ihrem Namen durch den Ausbilder %(uploader)s

source: You can view the uploaded solution here:
de: Sie koennen die hochgeladene Loesung hier einsehen:

source: The upload included these files:
de: Der Upload umfasste diese Dateien:

source: Please keep this email and the files you have uploaded to verify that you've completed the task.
de: Bitte bewahren Sie diese E-Mail und die von Ihnen hochgeladenen Dateien auf, um zu ueberpruefen, ob Sie die Aufgabe erfuellt haben.

source: Submission date:
de: Einreichungsdatum:

source: My Solutions
de: Meine Lösungen

source: Got Problems?
de: Haben Sie Probleme?

source: <a> Your tutor%(tutors.count|pluralize)s: </a>
de: <a> Ihr Tutor%(tutors.count|pluralize)s: </a>

source: Your trainer
de: Ihr Trainer

source: Expired tasks
de: Abgelaufene Aufgaben

source: Upcoming tasks
de: Bevorstehende Aufgaben

source: Final solution submitted %(final_solution.creation_date|timesince)s ago.
de: Die endgültige Lösung wurde vor %(final_solution.creation_date|timesince)s eingereicht.

source: No tasks to be submitted at the moment.
de: Zur Zeit keine einzureichenden Aufgaben.

source: <h2>Result Overview</h2>
de: <h2>Ergebnisübersicht</h2>

source: <tr><th>Task</th><th>Grade</th><th>Rating Scale</th></tr>
de: <tr><<th>Aufgabe</th><th>Bewertung</th><th>Bewertungsskala</th></tr>

source: <tr class="final_grade"><td>Final Grade</td><td>%(user.final_grade)s</td></tr>
de: <tr class="final_grade"><td>Endnote</td><td>%(user.final_grade)s</td></tr>

source: <tr class="final_grade"><td>Predicted Final Grade</td><td>%(calculated_grade)s</td></tr>
de: <tr class="final_grade"><td>Vorhergesagte Endnote</td><td>%(calculated_grade)s</td></tr>
